10/data/attachments/8956ff1cb2491edf.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ea7829f-6e42-42c6-bed8-bc3abca5e30d</nif:username>
            <nif:friendToBeAdded>Shawn_reason_Friend_73494_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>